{
  "header": {
    "greeting": "Hello!, I am <span>Julio</span>",
    "description": "Full Stack Web Developer with knowledge in JavaScript and Python for embedded application development.",
    "cvButton": "View CV",
    "contactButton": "Contact"
  },
  "about": {
    "title": "About Me",
    "description1": "I am a self-taught full stack web developer with knowledge in JavaScript and Python, and a solid foundation in HTML and CSS.",
    "description2": "In JavaScript, I have worked with React, Next.js, Express, and a bit of Nest.js to build web applications and REST APIs with authentication services (JWT) and relational and NoSQL databases, using both ORMs (Prisma) and ODMs (Mongoose), as well as SQL and NoSQL queries, email services, and cloud storage solutions like AWS S3.",
    "description3": "In Python, I mainly use Flask to build APIs with JWT authentication and SQLAlchemy as an ORM for SQL databases. I have basic knowledge of Django and am currently learning FastAPI.",
    "description4": "I also have experience deploying applications on various IaaS and PaaS services, as well as in SQL, serverless, and Docker. I am always looking for best practices in software development and cybersecurity.",
    "contactText": "If you are looking for a self-taught full stack web developer with knowledge in JavaScript and Python, don't hesitate to hire me.",
    "name": "Julio Sanic",
    "hireMeButton": "Hire Me"
  },
  "projects": {
    "title": "My Projects",
    "description": "Some of my projects."
  },
  "services": {
    "title": "Services",
    "description": "The services I offer in the field of programming:",
    "services": [
      {
        "id": 1,
        "title": "Web Design",
        "description": "Design of web pages with the latest technologies and market trends.",
        "viewMoreButton": "View More"
      },
      {
        "id": 2,
        "title": "Web Development",
        "description": "Development of custom websites and web applications.",
        "viewMoreButton": "View More"
      },
      {
        "id": 3,
        "title": "REST API Development",
        "description": "Development of REST APIs to integrate with web and mobile applications.",
        "viewMoreButton": "View More"
      },
      {
        "id": 4,
        "title": "Email Marketing Development",
        "description": "Development of email marketing campaigns to retain your customers.",
        "viewMoreButton": "View More"
      }
    ]
  },
  "education": {
    "title": "Education",
    "description": "My educational background:",
    "education": [
      {
        "id": 1,
        "title": "Fullstack Web Developer",
        "institution": "Udemy",
        "description": "<p>In my opinion, Udemy offers high-quality courses with industry professionals. Here are the courses I've taken on this platform:</p><h5>React: The Complete Guide (incl. React Router & Redux)</h5><p>This is a long but very comprehensive course covering everything from basic React concepts such as JSX, components, props, lifting state up, events, styles, etc., to intermediate and advanced concepts like hooks for managing state between components, such as useReducer and useContext, effects with useEffect, HTTP requests, routing with React Router, form validation, error handling, optimizations, global state with RTK, and best practices.</p><h5>Next.js & React - The Complete Guide</h5><p>This course teaches the basics of NextJS 13 and 14, including server components, image optimization, server actions, and some SSR. However, it is more focused on older versions of NextJS. Therefore, I have been updating myself with the official NextJS documentation and some YouTube tutorials to learn about authentication with NextAuth, middleware, and other topics.</p><h5>CSS Bootcamp - Master CSS (CSS Grid / CSS Flexbox)</h5><p>This is a very good course on positioning elements with flex and grid, which has helped me rely less on media queries when it comes to responsive design.</p><h5>MERN From Scratch 2023 | eCommerce Platform</h5><p>This course involves creating an ecommerce platform with the MERN stack. It's a real-world application and has helped me understand how to structure a fullstack application with React, Node, Express, and MongoDB. It also includes working with RTK Query to handle HTTP requests and cache them efficiently.</p><h5>React Native - The Practical Guide</h5><p>Possibly the most comprehensive React Native course I have seen online. The course is entirely based on creating various applications with Expo and React Navigation, incorporating device features like the camera, geolocation, push notifications, etc.</p><p>Other courses I am currently taking include one on C# and animations with CSS and JavaScript.</p>",
        "viewDocumentsButton": "View Documents"
      },
      {
        "id": 2,
        "title": "Electronics Engineering",
        "institution": "Universidad de San Carlos de Guatemala",
        "description": "<p>Regarding software development, the Electronics Engineering degree has provided me with a foundation in Python and C++ that has helped me understand programming logic and become familiar with programming language syntax.</p><p>Additionally, I have learned to work with microcontrollers that have a wireless communication protocol stack, allowing me to create real-time dashboards with React and sensors.</p>",
        "viewDocumentsButton": "View Documents"
      },
      {
        "id": 3,
        "title": "Electrical Engineering",
        "institution": "Universidad de San Carlos de Guatemala",
        "description": "<p>There are some interesting courses from a programming perspective, such as Automation, Electronics 3, Control Systems, Instrumentation, among others. Professional courses include Power System Analysis, which allows for developing programs for calculating Guatemala's power system, and Generation Systems to understand the dispatch of electrical energy through optimization algorithms.</p>",
        "viewDocumentsButton": "View Documents"
      }
    ]
  },
  "footer": {
    "title": "Node.js, React, Next.js, and Python Developer",
    "description": "I am a programmer who uses JavaScript and Python for web and mobile application development. If you want to hire me, feel free to contact me.",
    "contact": {
      "title": "Contact Me",
      "phone": "+502 5838-5370",
      "email1": "2596787670101@ingenieria.usac.edu.gt",
      "email2": "julio.sanic.gt.256@gmail.com"
    },
    "navbar": {
      "home": "Home",
      "projects": "Projects",
      "blog": "Blog",
      "contact": "Contact"
    },
    "rights": "All rights reserved"
  },
  "navbar": {
    "home": "Home",
    "projects": "Projects",
    "blog": "Blog",
    "theme": "Theme",
    "signIn": "Sign In",
    "signOut": "Sign Out"
  },
  "contact": {
    "title": "Contact Me",
    "description": "If you are interested in hiring me or have any questions, please fill out the form below.",
    "nameInputPlaceholder": "Name",
    "emailInputPlaceholder": "Email",
    "messageInputPlaceholder": "Message",
    "sendButton": "Send",
    "sendingButton": "Sending...",
    "thanksTitle": "Thank you for contacting me!",
    "thanksMessage": "I will get back to you as soon as possible.",
    "sendAnotherMessage": "Send another message",
    "sendAnotherMessageLink": "Click here"
  }
}
