{
  "header": {
    "greeting": "¡Qué tal!, soy <span>Julio</span>",
    "description": "Desarrollador Web Full Stack con conocimientos en JavaScript y Python para el desarrollo de aplicaciones embebidas.",
    "cvButton": "Ver CV",
    "contactButton": "Contactar"
  },
  "about": {
    "title": "Sobre Mí",
    "description1": "Soy un desarrollador web full stack autodidacta con conocimientos en los lenguajes de programación JavaScript y Python, además de tener buenas bases en HTML y CSS.",
    "description2": "En JavaScript, he trabajado con React, Next.js, Express y un poco de Nest.js para crear aplicaciones web y APIs REST con servicios de autenticación (JWT) y bases de datos relacionales y NoSQL, tanto con ORMs (Prisma) como con ODMs (Mongoose), así como consultas SQL y NoSQL, además de otros servicios como el envío de correos electrónicos y el manejo de servicios de almacenamiento en la nube como AWS S3.",
    "description3": "En Python, uso principalmente Flask para crear APIs con autenticación JWT y SQLAlchemy como ORM para bases de datos SQL. Tengo conocimientos básicos de Django y actualmente estoy aprendiendo FastAPI.",
    "description4": "También tengo experiencia en el despliegue de aplicaciones en varios servicios IaaS y PaaS, así como en SQL, serverless y Docker. Además, siempre estoy en busca de buenas prácticas para el desarrollo de software y la seguridad informática.",
    "contactText": "Si buscas un desarrollador web fullstack autodidacta con conocimientos en JavaScript y Python, no dudes en contratarme.",
    "name": "Julio Sanic",
    "hireMeButton": "Contrátame"
  },
  "projects": {
    "title": "Mis Proyectos",
    "description": "Algunos de mis proyectos."
  },
  "services": {
    "title": "Servicios",
    "description": "Los servicios que ofrezco en el ámbito de la programación:",
    "services": [
      {
        "id": 1,
        "title": "Diseño Web",
        "description": "Diseño de páginas web con las últimas tecnologías y tendencias del mercado.",
        "viewMoreButton": "Ver más"
      },
      {
        "id": 2,
        "title": "Desarrollo Web",
        "description": "Desarrollo de sitios web y aplicaciones web a medida.",
        "viewMoreButton": "Ver más"
      },
      {
        "id": 3,
        "title": "Desarrollo de Rest API",
        "description": "Desarrollo de API REST para integrar con aplicaciones web y móviles.",
        "viewMoreButton": "Ver más"
      },
      {
        "id": 4,
        "title": "Desarrollo de email marketing",
        "description": "Desarrollo de campañas de email marketing para fidelizar a tus clientes.",
        "viewMoreButton": "Ver más"
      }
    ]
  },
  "education": {
    "title": "Educación",
    "description": "Mi formación académica:",
    "education": [
      {
        "id": 1,
        "title": "Desarrollador Web Fullstack",
        "institution": "Udemy",
        "description": "<p>A mi parecer, en Udemy se encuentran cursos de calidad con profesionales de la industria. A continuación, te presento los cursos que he tomado en esta plataforma:</p><h5>React: The Complete Guide (incl. React Router & Redux)</h5><p>Es un curso largo pero muy completo que abarca desde los conceptos básicos de React como lo puede ser JSX, componentes, props, lifting state up, eventos, estilos etc. Hasta conceptos intermedios y avanzados como hooks para manejar estados entre componentes, como lo es useReducer y useContext, efectos con useEffect, soliciuted HTTP, rutas con React Router, validación de formularios, manejo de errores, optimizaciones, estado global con RTK y buenas prácticas, entre otros.</p><h5>Next.js & React - The Complete Guide</h5><p>Es un curso que enseña las bases de NextJS 13 y 14 como server components, image optimization, server actions y un poco de SSR, pero es un curso destiando más a las versioes anteriores de NextJS. Así que me he estado actualizando con la documentación oficial de NextJS y algunos tutoriales en YouTube para aprender autenticación con NextAuth, middleware entre otros temas.</p><h5>CSS Bootcamp - Master CSS (CSS Grid / CSS Flexbox)</h5><p>Es un curso muy bueno con respecto al posicionamiento de elementos con flex y grid que me ha ayudado a depender menos de media queries cuando se trata de responsive design.</p><h5>MERN From Scratch 2023 | eCommerce Platform</h5><p>El curso consiste en realizar un ecommerce con el stack MERN. Es una aplicación de la vida real y me ha ayudado a entender como se estructura una aplicación fullstack con React, Node, Express y MongoDB. Además de trabajar con RTK query para manejar solicitudes HTTP y almacenarlas en la cache de una manera eficiente.</p><h5>React Native - The Practical Guide</h5><p>Posiblemente el curso más completo que he visto de React Native en todo internet. El curso se bas completamente en crear varias aplicaciones con expo y react Navigation con device features como la cámara, geolocalización, notificaciones push, etc.</p><p>Otros cursos que estoy tomando actualmente está uno de c# y aniamaciones con CSS y JavaScript.</p>",
        "viewDocumentsButton": "Ver Documentos"
      },
      {
        "id": 2,
        "title": "Ingeniería en Electrónica",
        "institution": "Universidad de San Carlos de Guatemala",
        "description": "<p>Respecto al campo del desarrollo de software, la carrera de Ingeniería en Electrónica me ha proporcionado bases en Pyton y C++ que me han ayudado a entender la lógica de programación y a familiarizarme con la sintaxis de los lenguajes de programación.</p><p>Además de eso, he aprendido a trabajar con microcontroladores que tienen un stack de protocolos de comunicación inalámbrica que me ha permitido hacer dashboards con React en tiempo real con sensores.</p>",
        "viewDocumentsButton": "Ver Documentos"
      },
      {
        "id": 3,
        "title": "Ingeniería en Electricidad",
        "institution": "Universidad de San Carlos de Guatemala",
        "description": "<p>Hay algunos cursos interesantes desde el punto de vista de la programación, como lo es Automatización, Electrónica 3, Sistemas de control, Instrumentación, entre otros. De los cursos profesionales están Analísis de Sismteas de Potencia que permite desarrollar programas para el cálculo del sistema eléctrico de potencia de Guatemala y Sistemas de Generación para entender el despacho de energía eléctrica por medio de algoritmos de optimización.</p>",
        "viewDocumentsButton": "Ver Documentos"
      }
    ]
  },
  "footer": {
    "title": "Desarrollador de Node.js, React, Next.js y Python",
    "description": "Soy un programador que utiliza JavaScript y Python para el desarrollo de aplicaciones web y móviles. Si deseas contratarme, no dudes en ponerte en contacto conmigo.",
    "contact": {
      "title": "Contáctame",
      "phone": "+502 39802176",
      "email1": "2596787670101@ingenieria.usac.edu.gt",
      "email2": "julio.sanic.gt.256@gmail.com"
    },
    "navbar": {
      "home": "Inicio",
      "projects": "Proyectos",
      "blog": "Blog",
      "contact": "Contacto"
    },
    "rights": "Todos los derechos reservados"
  },
  "navbar": {
    "home": "Inicio",
    "projects": "Proyectos",
    "blog": "Blog",
    "theme": "Tema",
    "signIn": "Iniciar Sesion",
    "signOut": "Cerrar Sesión"
  },
  "contact": {
    "title": "Contacto",
    "description": "Si deseas ponerte en contacto conmigo, puedes hacerlo a través del siguiente formulario:",
    "nameInputPlaceholder": "Nombre",
    "emailInputPlaceholder": "Correo Electrónico",
    "messageInputPlaceholder": "Mensaje",
    "sendButton": "Enviar",
    "sendingButton": "Enviando...",
    "thanksTitle": "¡Gracias por contactarme!",
    "thanksMessage": "Tu mensaje ha sido enviado con éxito. En breve me pondré en contacto contigo.",
    "sendAnotherMessage": "Enviar otro mensaje",
    "sendAnotherMessageLink": "Haz clic aquí"
  }
}
